In [3]:
import numpy as np
import pandas as pd

In [4]:
data=pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [5]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [6]:
data[0]

0.25

In [7]:
data[0:3]

0    0.25
1    0.50
2    0.75
dtype: float64

In [8]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
data=pd.Series([1,2,3,4],index=['a','b','c','d'])
data

a    1
b    2
c    3
d    4
dtype: int64

In [10]:
data['a']

1

In [11]:
data['a':'c']

a    1
b    2
c    3
dtype: int64

In [12]:
d={'a':1,'b':2,'c':3,'d':4}
data=pd.Series(d)
data

a    1
b    2
c    3
d    4
dtype: int64

In [13]:
data=pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2])
data

3    c
2    a
dtype: object

In [14]:
a=pd.Series(['a','b','c','d'])
b=pd.Series([1,2,3,4])
data=pd.DataFrame({'a':a,'b':b})
data

   a  b
0  a  1
1  b  2
2  c  3
3  d  4

In [15]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297, 'Florida': 170312, 'Illinois': 149995}
population_dict = {'California': 38332521, 'Texas': 26448193, 'New York': 19651127,'Florida': 19552860, 'Illinois':12882135} 
population = pd.Series(population_dict)
area = pd.Series(area_dict)
states = pd.DataFrame({'population': population,'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [16]:
d=[{'a':1,'b':2}]
data=pd.DataFrame(d)
data

   a  b
0  1  2

In [17]:
data=pd.DataFrame({'col1':[1,2,3],'col2':[4,5,6]})
data

   col1  col2
0     1     4
1     2     5
2     3     6

In [18]:
data=pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c':4}])
data

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [19]:
data = pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]),columns=['a', 'b', 'c'])
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [20]:
data.iloc[0:1]

   a  b  c
0  1  2  3

In [21]:
data.iloc[0:2]

   a  b  c
0  1  2  3
1  4  5  6

In [23]:
data.iloc[0:2,0:2]

   a  b
0  1  2
1  4  5